slides/02-prompting.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Prompting Básico</title>
<meta name="author" content="Lucas S. Vieira"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/theme/night.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="./slide_02.gif"><p style="font-size:0.7em;opacity:0.6;">Lucas S. Vieira</p><br/><h2>Prompting Básico</h2><br/><p style="font-size:0.85em;opacity:0.8;">Como falar com IA</p><br/><p style="font-size:0.9em;color:#FFB033;">Guilda de IA</p>
</section>
<section>
<section id="slide-orgd6e3bfa">
<h2 id="orgd6e3bfa">Fofoca da Semana 🗞️</h2>
<ul>
<li><b>Kimi K2.6</b> (20/04) — 1T, 32B ativos, 256K ctx, open weights</li>
<li><b>DeepSeek V4 Pro</b> (24/04) — 1.6T, 49B ativos, 1M ctx, MIT</li>
<li><b>Claude Code</b> (21/04) — removido e reposto no Pro em 12h 👀</li>

</ul>
</section>
<section id="slide-org6606458">
<h3 id="org6606458">Claude Code — O Episódio</h3>
<p>
21/04: plano Pro ($20/mês) perdeu o Claude Code.
12h depois, voltou.
</p>

<blockquote >
<p>
"Usage has changed a lot and our current plans
weren't built for this." — Anthropic
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-org7c61843">
<h2 id="org7c61843">O Problema</h2>
<p>
A mesma pergunta pode gerar respostas completamente diferentes,
dependendo de como você formula.
</p>

<p>
<b>Vago:</b> <code>Me fale sobre gatos</code> → resposta genérica
</p>

<p>
<b>Específico:</b> <code>Quais as 3 raças de gatos mais populares no Brasil e por quê?</code> → resposta específica
</p>
</section>
</section>
<section>
<section id="slide-org6321dc9">
<h2 id="org6321dc9">🔴 Demo ao vivo (2 min)</h2>
<p>
Abram um chat:
</p>
<ul>
<li><a href="https://aistudio.google.com/">Gemini</a> / <a href="https://chat.mistral.ai">Le Chat</a> / <code>ollama run qwen3.5:4b</code> / <code>ollama run deepseek-v4-flash:cloud</code></li>

</ul>

<p>
Testem os dois prompts do slide anterior. Notem a diferença.
</p>
</section>
</section>
<section>
<section id="slide-org7f5b846">
<h2 id="org7f5b846">O que é prompt?</h2>
<ul>
<li>Prompt = instrução que você dá para o modelo</li>
<li>A pergunta, o comando, o contexto — tudo junto</li>

</ul>

<blockquote >
<p>
O prompt é como uma receita.
Ingredientes claros = prato previsível.
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-orga291cc1">
<h2 id="orga291cc1">Zero-shot</h2>
<p>
Você pede algo sem dar exemplos.
</p>

<div class="org-src-container">

<pre   ><code class="text" >Traduza para inglês: "Bom dia"
</code></pre>
</div>

<p>
O modelo nunca viu você traduzir antes, mas tenta.
</p>

<p>
💡 Ambíguo: <code>"Banco"</code> → <code>bank</code> ou <code>bench</code>?
Sem contexto, o modelo chuta.
</p>
</section>
</section>
<section>
<section id="slide-org5fede89">
<h2 id="org5fede89">Few-shot</h2>
<p>
Você dá exemplos antes de pedir.
</p>

<div class="org-src-container">

<pre   ><code class="text" >Traduza para inglês:
"Gato" → "Cat"
"Cachorro" → "Dog"
"Pássaro" → ?
</code></pre>
</div>

<p>
O modelo aprende o padrão pelos exemplos.
</p>

<blockquote >
<p>
Exemplos são como mostrar em vez de explicar.
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-org9c00df7">
<h2 id="org9c00df7">🔴 Demo: Zero-shot vs Few-shot (3 min)</h2>
<div class="org-src-container">

<pre   ><code class="text" ># Zero-shot:
Classifique: "Esse filme é incrível!"

# Few-shot:
Classifique o sentimento:
"Odiei o filme" → Negativo
"Adorei, recomendo" → Positivo
"Esse filme é incrível!" → ?
</code></pre>
</div>

<p>
💡 Testem com "Mais ou menos" — vejam a diferença.
</p>
</section>
</section>
<section>
<section id="slide-org8bbd9f0">
<h2 id="org8bbd9f0">Role Prompting</h2>
<p>
Atribuir um <b>papel</b> ao modelo muda a qualidade da resposta.
</p>

<div class="org-src-container">

<pre   ><code class="text" >Você é uma professora de matemática do ensino
médio, paciente e didática.
</code></pre>
</div>

<p>
Role + contexto = o modelo opera dentro de um escopo.
</p>

<p>
💡 <b>Vai ser essencial pra agentes:</b> o system prompt
de um agente é role prompting.
</p>
</section>
</section>
<section>
<section id="slide-orgf28b45d">
<h2 id="orgf28b45d">🔴 Demo: Role Prompting (3 min)</h2>
<div class="org-src-container">

<pre   ><code class="text" ># Sem role:
"Explique derivadas"

# Com role:
"Você é uma professora de matemática do ensino
médio, paciente e didática. Explique derivadas."
</code></pre>
</div>

<p>
💡 Troque o role pra "professor universitário" —
a resposta muda completamente.
</p>
</section>
</section>
<section>
<section id="slide-orgc98a3d2">
<h2 id="orgc98a3d2">Chain-of-Thought (CoT)</h2>
<p>
Pedir ao modelo para <b>pensar passo a passo</b>.
</p>

<div class="org-src-container">

<pre   ><code class="text" >Pergunta: Roger tem 5 bolas. Ele compra 2 latas
de 3 bolas cada. Quantas bolas ele tem?

Pense passo a passo.
</code></pre>
</div>

<p>
Sem CoT: pode errar. Com CoT: mostra o raciocínio.
</p>

<p>
💡 Ferramentas exigem raciocínio sobre qual usar e quando.
</p>
</section>
</section>
<section>
<section id="slide-org1eadfdf">
<h2 id="org1eadfdf">🔴 Demo: CoT (3 min)</h2>
<div class="org-src-container">

<pre   ><code class="text" ># Sem CoT:
"Na livraria, um livro custa R$ 25.
Comprei 3 livros e paguei com R$ 100.
Quanto troco recebo?"

# Com CoT: (mesma pergunta +)
"Pense passo a passo."
</code></pre>
</div>

<p>
💡 Em modelos menores (local), a diferença é dramática.
</p>
</section>
</section>
<section>
<section id="slide-org59c1aa5">
<h2 id="org59c1aa5">Framework RCEF</h2>
<p>
Os 4 elementos de um prompt eficaz:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Letra</th>
<th scope="col" class="org-left">Significado</th>
<th scope="col" class="org-left">Exemplo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>R</b></td>
<td class="org-left">Role</td>
<td class="org-left">"Você é um tutor de matemática"</td>
</tr>

<tr>
<td class="org-left"><b>C</b></td>
<td class="org-left">Context</td>
<td class="org-left">"O aluno está no ensino médio"</td>
</tr>

<tr>
<td class="org-left"><b>E</b></td>
<td class="org-left">Examples</td>
<td class="org-left">"2x + 3 = 7 → x = 2"</td>
</tr>

<tr>
<td class="org-left"><b>F</b></td>
<td class="org-left">Format</td>
<td class="org-left">"Responda em bullets"</td>
</tr>
</tbody>
</table>
</section>
</section>
<section>
<section id="slide-orga1212b6">
<h2 id="orga1212b6">RCEF + Task &amp; Constraints</h2>
<p>
Pra prompts completos, adicione:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Letra</th>
<th scope="col" class="org-left">Significado</th>
<th scope="col" class="org-left">Exemplo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>T</b></td>
<td class="org-left">Task</td>
<td class="org-left">"Resolva esta equação"</td>
</tr>

<tr>
<td class="org-left"><b>C</b></td>
<td class="org-left">Constraints</td>
<td class="org-left">"Máximo 3 passos"</td>
</tr>
</tbody>
</table>

<p>
<b>T</b> = o que fazer. <b>C</b> = o que não fazer.
💡 Zero-shot = sem E. Few-shot = com E. Role = R.
RCEF-TC vai virar a linguagem pra descrever ferramentas.
</p>
</section>
</section>
<section>
<section id="slide-org3866a54">
<h2 id="org3866a54">RCEF-TC na prática</h2>
<div class="org-src-container">

<pre   ><code class="text" >R: Você é um desenvolvedor Python sênior.
C: A função processa dados de uma API externa.
E: Input: [1,2,3] → Output: {"dados": [...]}
T: Sugira melhorias de legibilidade e erros.
F: Uma melhoria por tópico, com código antes/depois.
C: Python 3.9+, soluções simples primeiro.
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org80e2437">
<h2 id="org80e2437">Prompting para código</h2>
<p>
❌ <b>"Escreve uma função pra mim"</b>
</p>

<p>
✅ Com RCEF-TC:
</p>

<div class="org-src-container">

<pre   ><code class="text" >R: Você é um dev Python especialista em API design.
T: Crie uma função que valida CPF brasileiro.
C: A função será usada num form de cadastro.
F: Retorne bool + mensagem de erro se inválido.
C: Sem bibliotecas externas, máximo 20 linhas.
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org0a45df4">
<h2 id="org0a45df4">🔴 Demo: RCEF-TC (5 min)</h2>
<p>
Exercício: Refatore <code>Me ajuda com meu TCC</code> com RCEF-TC
</p>

<ul>
<li><b>R</b> — Quem é o modelo? (tutor, revisor, orientador?)</li>
<li><b>C</b> — Qual área? Qual semestre?</li>
<li><b>T</b> — Revisão? Escrita? Ideias?</li>
<li><b>F</b> — Como quer a resposta?</li>
<li><b>C</b> — Quantas páginas? Qual prazo?</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgef3ca11">
<h2 id="orgef3ca11">Prompting para ferramentas (preview)</h2>
<p>
Quando construímos agentes, precisamos <b>descrever
ferramentas</b> para o modelo.
</p>

<p>
Uma ferramenta é, essencialmente, um prompt estruturado:
<code>description</code> segue RCEF-TC.
</p>
</section>
</section>
<section>
<section id="slide-orga6ce1c7">
<h2 id="orga6ce1c7">Tool calling — exemplo</h2>
<div class="org-src-container">

<pre   ><code class="python" >{
  "name": "buscar_cpf",
  "description": "Busca dados de uma pessoa
     pelo CPF. Use para validar cadastros.",
  "parameters": {
    "cpf": "string — CPF com 11 dígitos"
  }
}
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org85ed28b">
<h2 id="org85ed28b">Alucinações vs Prompt ruim</h2>
<p>
Às vezes o modelo erra. Por quê?
</p>

<ol>
<li><b>Alucinação</b> → modelo inventa (limitação dele)</li>
<li><b>Prompt ruim</b> → você não deixou claro (limitação sua)</li>

</ol>

<p>
Como distinguir: refaça o prompt com mais contexto.
Se ainda errar → alucinação. Se melhorar → prompt ruim.
</p>
</section>
</section>
<section>
<section id="slide-orgce24dd0">
<h2 id="orgce24dd0">🔴 Demo: Alucinação vs Prompt ruim (3 min)</h2>
<div class="org-src-container">

<pre   ><code class="text" ># Prompt vago:
"Quem ganhou a copa de 2042?"
</code></pre>
</div>

<p>
Se responder como se soubesse → alucinação.
</p>

<div class="org-src-container">

<pre   ><code class="text" ># Prompt com constraint:
"Quem ganhou a copa de 2042?
Responda apenas se tiver certeza.
Se não souber, diga que não sabe."
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgeb148c8">
<h2 id="orgeb148c8">Modelos disponíveis hoje</h2>
<p>
Para as demonstrações:
</p>
<ul>
<li><a href="https://aistudio.google.com/">Gemini 2.5 Flash</a> — Cloud grátis</li>
<li><a href="https://chat.mistral.ai">Mistral Le Chat</a> / <a href="https://chat.deepseek.com">DeepSeek V4</a> — Cloud grátis</li>
<li><code>ollama run deepseek-v4-flash:cloud</code> — Cloud</li>
<li><code>ollama run qwen3.5:4b</code> / <code>qwen3.5:9b</code> — Local</li>

</ul>

<p>
⚠ <code>:cloud</code> no Ollama = nuvem, não local.
</p>
</section>
</section>
<section>
<section id="slide-org9e5fd8f">
<h2 id="org9e5fd8f">Modelos — resumo</h2>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Modelo</th>
<th scope="col" class="org-left">Onde</th>
<th scope="col" class="org-left">Tipo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Gemini 2.5 Flash</td>
<td class="org-left"><a href="https://aistudio.google.com/">AI Studio</a></td>
<td class="org-left">Cloud grátis</td>
</tr>

<tr>
<td class="org-left">Mistral Le Chat</td>
<td class="org-left"><a href="https://chat.mistral.ai">chat.mistral.ai</a></td>
<td class="org-left">Cloud grátis</td>
</tr>

<tr>
<td class="org-left">DeepSeek V4 Pro</td>
<td class="org-left"><a href="https://chat.deepseek.com">chat.deepseek.com</a></td>
<td class="org-left">Cloud grátis</td>
</tr>

<tr>
<td class="org-left">DeepSeek V4 Flash</td>
<td class="org-left">Ollama cloud</td>
<td class="org-left">Cloud</td>
</tr>

<tr>
<td class="org-left">Qwen3.5:4b</td>
<td class="org-left">Ollama local</td>
<td class="org-left">Local</td>
</tr>

<tr>
<td class="org-left">Qwen3.5:9b</td>
<td class="org-left">Ollama local</td>
<td class="org-left">Local</td>
</tr>
</tbody>
</table>
</section>
</section>
<section>
<section id="slide-org9948e38">
<h2 id="org9948e38">DeepSeek V4 Pro — Novidade!</h2>
<p>
Lançado em 24/04/2026:
</p>
<ul>
<li>1.6T parâmetros, 49B ativos (MoE), 1M contexto</li>
<li>Open weights (MIT License)</li>
<li>MMLU: 90.1% · HumanEval: 76.8%</li>
<li>Chat: <a href="https://chat.deepseek.com">chat.deepseek.com</a></li>

</ul>

<p>
1M contexto = 1 milhão de tokens.
Cabe um livro inteiro no prompt!
</p>
</section>
</section>
<section>
<section id="slide-org8d1c5f0">
<h2 id="org8d1c5f0">ask-ai: CLI local</h2>
<p>
O <code>ask-ai</code> é um CLI que conversa com modelos locais:
</p>

<div class="org-src-container">

<pre   ><code class="shell" ># Chat interativo
ask-ai chat -m qwen3.5:4b
# Pergunta direta
ask-ai "Traduza para inglês: Bom dia"
# Com system prompt (role prompting!)
ask-ai -p tool_user "Como formato um JSON?"
</code></pre>
</div>

<p>
Os modos <code>default</code> vs <code>tool_user</code> são <b>role prompting aplicado!</b>
</p>
</section>
</section>
<section>
<section id="slide-orgcdb9479">
<h2 id="orgcdb9479">Dicas práticas</h2>
<p>
✅ <b>Bom:</b>
</p>
<div class="org-src-container">

<pre   ><code class="text" >"Liste as 5 capitais mais populosas do Brasil
 em ordem decrescente"
"Explique recursão como se eu tivesse 12 anos"
"Corrija o texto abaixo mantendo o estilo do autor"
</code></pre>
</div>

<p>
❌ <b>Ruim:</b>
</p>
<div class="org-src-container">

<pre   ><code class="text" >"Me fale algo" (vago demais)
"O que você acha?" (subjetivo)
"Responda sim ou não: o número 7 é legal?" (não factual)
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgbbc48e0">
<h2 id="orgbbc48e0">Para lembrar</h2>
<blockquote >
<p>
"O prompt é como uma receita.
Ingredientes claros = prato previsível."
</p>
</blockquote>

<p>
Quanto mais específico você for,
mais próxima a resposta do que você espera.
</p>

<p>
Na próxima aula: vamos programar isso tudo em Python!
</p>
</section>
</section>
<section>
<section id="slide-org8125f97">
<h2 id="org8125f97">Próxima semana</h2>
<ul>
<li>Python mínimo para LLMs</li>
<li>Google Colab</li>
<li>Chamando API com código</li>
<li>System prompt via código = Role Prompting aplicado</li>

</ul>
</section>
</section>
<section>
<section id="slide-org565bb9f" data-background="./slide_02.gif">
<h2 id="org565bb9f">Perguntas?</h2>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]

});

</script>
</body>
</html>
